# RebarHandlePositionData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandlePositionData Class
Members See Also
---
The class that contains data for the handle position calculation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class RebarHandlePositionData : IDisposable
```

Visual Basic
---
```text
Public Class RebarHandlePositionData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarHandlePositionData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarHandlePositionData
# See Also
RebarHandlePositionData Members
Autodesk.Revit.DB.Structure Namespace